-- phpMyAdmin SQL Dump
-- version 4.9.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Nov 19, 2020 at 01:09 PM
-- Server version: 8.0.17
-- PHP Version: 7.3.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `oramentalfishdb`
--

-- --------------------------------------------------------

--
-- Table structure for table `fishdb`
--

CREATE TABLE `fishdb` (
  `No` int(11) NOT NULL,
  `Name` varchar(32) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `Common_name` varchar(139) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `Feature` varchar(808) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `Feed` varchar(184) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `Aquarium` varchar(363) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `fishdb`
--

INSERT INTO `fishdb` (`No`, `Name`, `Common_name`, `Feature`, `Feed`, `Aquarium`) VALUES
(1, 'สวาย', 'Albino-Stripped-catfish', 'เป็นปลาไม่มีเกล็ดขนาดใหญ่ ลำตัวเรียวยาว แบนข้างเล็กน้อย หัวแบนลงเล็กน้อย สีลำตัวในปลาโตเต็มวัยเป็นสีเทาเข้มหรือเทาอมน้ำตาลบริเวณท้องสีขาว ในลูกปลาทีมีขนาดต่ำกว่า 20 ซม. จะมีแถบสีดำ 3 แถบ ตามความยาวลำตัว แถบแรกอยู่ค่อนไปทางด้านหลัง แถบที่สองอยู่แนวเส้นข้างตัว แถบที่สามอยู่เหนือฐานครีบอกแล้วโค้งลงจนจรดปลายครีบก้น แถบสีดำจะจางลงไปเมื่อลูกปลาโตขึ้นและจะหายไปหมดเมื่อปลามีขนาดความยาวประมาณ 35 ซม. ปากอยู่ต่ำขากรรไกรล่างยาวกว่าขากรรไกรบน ฟันที่ขากรรไกรเล็กละเอียด ตามีขนาดเล็กอยู่หลังมุมปากอยู่ในระดับเดียวกับมุมปากหรือต่ำกว่าเพียงเลกน้อย มีหนวด 2 คู่ครีบหางค่อนข้างยาวและเว้าลึก', 'พืชน้ำและสัตว์น้ำขนาดเล็ก', 'เลี้ยงในตู้ขนาดใหญ่ ตกแต่งด้วยก่อนหิน ปัจจุบันมีการคัดสายพันธุ์เป็นปลาเผือกซึ่งได้รับความนิยมเรียกว่า “สวายเผือก” การเลี้ยงในตู้ปลานิยมเลี้ยงปลาสวายเผือกขนาดเล็กมากกว่าปลาที่มีขนาดใหญ่'),
(2, 'เสือพ่นน้ำ', 'Archer-fish', 'ลำตัวสั้นป้อมแบนข้างมาก แนวสันหลังจากจะงอยปากถึงหน้าครีบหลังเกือบเป็นเส้นตรง ปากเฉียงขึ้นข้างบน ตาอยู่ใกล้แนวสันหลังมีรอยประสีดำบริเวณส่วนครึ่งบนลำตัว 5-6 แต้ม ขอบครีบหลังและครีบก้นมีสีดำ ขนาดใหญ่สุดความยาวประมาณ 25 ซม. เป็นปลาที่ชอบว่ายอยู่ผิวน้ำ มีความสามารถพ่นน้ำไปได้ไกล ๆ เพื่อล่าแมลงต่าง ๆ มาเป็นอาหารการพ่นน้ำทำได้โดยแรงกดดันอย่างรวดเร็วของแผ่นปิดเหงือกและร่องแคบ ๆ ใต้เพดานปาก เมื่อพ่นน้ำโดนแมลงจนตกลงไปในน้ำจึงจะว่ายไปกินอย่างรวดเร็ว', 'แมลงน้ำ แพลงก์ตอน ตัวอ่อนแมลงน้ำ', 'เลี้ยงในตู้ขนาดกลางตกแต่งด้วยก้อนหินและพรรณไม้น้ำ สามารถเลี้ยงและให้พ่นน้ำจับแมลงในบ่อแบบ touch pool หรือในตู้ได้'),
(3, 'กระทิงไฟ', 'Armed-spiny-eel', 'มีลำตัวยาวคล้ายงูแบนข้างเล็กน้อย ลำตัวมีสีดำและแถบสีแดงประมาณ 4-5 แถบ พาดตามความยาวลำตัว ยกเว้นส่วนท้ายลำตัว ซึ่งแถบสีแดงจะไม่ค่อยติดต่อกันตลอดทำให้ดูมีลักษณะคล้ายจุดสีแดง ครีบหลังครีบหาง ครีบอก และครีบก้นมีสีดำ จะงอยปากยื่นยาว ที่ปลายของจะงอยปากมีจมูกลักษณะคล้ายท่อและมีช่องเป็ดตรงปลาย เป็นปลาขนาดใหญ่ ขนาดใหญ่สุดความยาวประมาณ 1 เมตร', 'กุ้งและสัตว์น้ำขนาดเล็ก', 'เลี้ยงในตู้ปลาขนาดใหญ่ ตกแต่งด้วยก้อนหินหรือขอนไม้เพื่อให้เป็นที่หลบซ้อนตัว'),
(4, 'มังกร', 'Asian-Arowana', 'ลำตัวแบนด้านข้าง ส่วนท้องแบนเป็นสันคม เกล็ดมีขนาดใหญ่และหนาเกล็ดบนเส้นข้างตัวมี 21-24 เกล็ด ครีบหลังและครีบก้นตั้งอยู่ค่อนไปทางปลายหาง ส่วนครีบอกยาวประมาณหนึ่งในสามของความยาวลำตัวครีบหางกลม ปากกว่างเฉียงขึ้นด้านบน ที่ปลายขากรรไกรล่างมีหนวดขนาดใหญ่แต่สั้นจำนวน 1 คู่ ขนาดใหญ่สุดความยาวประมาณ 1 เมตร', 'กบ เขียด สัตว์เลื้อยคลานขนาดเล็ก และแมลงขนาดใหญ่ เช่น แมลงสาบ จิ้งจก', 'เลี้ยงในตู้ขนาดใหญ่ ตกแต่งด้วยก้อนหินและพรรณไม้น้ำ มีความทนทานอยู่ในตู้ได้นาน'),
(5, 'แขยงหิน', 'Asian-bumblebee-catfish', 'เป็นปลาไม่มีเกล็ดขนาดเล็ก ลำตัวเรียวยาวแบนข้างเล็กน้อย หัวแบนลงเล็กน้อย ลำตัวสีเหลืองอ่อนหรือสีน้ำตาลอ่อน มีแถบสีดำขนาดใหญ่พาดขวางลำตัว 4 แถบ แถบที่ 1 พาดขวางส่วนหัวทั้งหมด แถบที่ 2 พาดจากบริเวณครีบหลังและแผ่นกว้างไปคลุมด้านล่างของลำตัวตั้งแต่ครีบอกจนถึงครีบท้อง แถบที่ 3 เริ่มจากบริเวณครีบไขมันพาดผ่านลำตัวไปยังครีบ ส่วนแถบที่ 4 พาดคลุมบริเวณโคนหางทั้งหมดปากขนาดเล็กอยู่ค่อนข้างต่ำ มีหนวด 4 คู่ หนวดที่ขากรรไกรบนยาวที่สุดยาวจนถึงครีบอก ส่วนหนวดคู่อื่น ๆ ยาวไม่ถึงครีบอก ครีบทุกครีบยกเว้นครีบอกสีเหลืองอ่อน มีแถบสีดำพาดขวางครีบประมาณ 1-2 แถบ ครีบอกสีเหลืองอ่อนมีจุดประสีดำ มีก้านครีบแข็งใหญ่แข็งแรงเป็นซี่ฟันเลื่อยครีบหลังมี 2 อัน ครีบหางเว้าลึกขนาดเฉลี่ยความยาวประมาณ 10 ซม. ขนาดใหญ่สุดที่พบความยาวประมาณ 20 ซม. เป็นปลาที่มีสีสันและลวดลายสวยงามมากชนิดหนึ่ง นิยมนำมาเลี้ยงในตู้ปลาและส่งไปจำหน่ายยังต่างประเทศ', 'ลูกปลา ลูกกุ้งขนาดเล็ก ตัวอ่อนแมลงน้ำ แพลงก์ตอน ซากพืชและซากสัตว์', 'เลี้ยงในตู้รวมกับปลาไม่มีเกล็ดชนิดอื่นที่มีขนาดใกล้เคียงกัน จัดตู้โดยวางวัสดุตกแต่งประเภทก้อนหินหรือขอนไม่เพื่อให้มีที่หลบซ้อน'),
(6, 'กดหม้อ', 'Black-catfish', 'ลักษณะลำตัวเพรียว หัวแบนและกว้าง สีลำตัวบริเวณด้านหลังและด้านข้างลำตัวเป็นสีม่วงดำหรือดำ บริเวณท้องสีขาวครีบหลังมี 2 อัน ครีบหลังอันแรกมีก้านครีบหยักเป็นฟันซี่เลื่อย ส่วนครีบหลังอันที่ 2 เป็นครีบไขมัน ครีบหางเว้าลึก ขอบบนและขอบล่างของครีบหางมีสีขาวหรือสีครีมส่วนหน้าของครีบและครีบก้นก็มีสีขาวหรือสีครีมเช่นเดียวกันปากกว้างมาก จะงอยปากป้าน มีหนวด 4 คู่ ปลากดหม้อ จัดเป็นปลาขนาดใหญ่สุดความยาวประมาณ 80 ซม. ', 'ปลาขนาดเล็ก ซากสัตว์ เป็นปลาชอบหากินในเวลากลางคืน กลางวันมักจะหลบซ้อนที่กำบัง', 'เป็นปลาขนาดใหญ่ เลี้ยงในตู้ขนาดใหญ่ ตกแต่งด้วยกรวดและก้อนหิน'),
(7, 'กาดำ', 'Black-shark', 'ลำตัวยาวเรียวแบนข้างเล็กน้อย สันหลังโค้งสูง ส่วนท้องแบน สีลำตัวและครีบทุกครีบสีดำสนิท หรือสีน้ำเงินอมดำหรือเทาอมน้ำตาล ในปลาที่มีอายุมากบริเวณของเกล็ดที่อยู่บริเวณด้านข้างลำตัวมีจุดสีแดงด้านล่างของส่วนหัวและบริเวณท้องจะมีสีจางกว่าบริเวณหลังและบริเวณด้านข้างลำตัว ปากอยู่ต่ำยืดหดได้และมีลักษณะแบบปากดูดริมฝีปากบนและล่างหยัก มีหนวด 2 คู่ ครีบหลังมีขนาดใหญ่และสูงมาก เมื่อเปรียบเทียบกับความยาวของหัวและความลึกของลำตัว พบว่าความสูงของครีบหลังมีมากกว่าความยาวของหัวและยาวเท่า ๆ กับ หรือ ยาวกว่าความลึกของลำตัว ครีบท้องยาวถึงตอนต้นของครีบก้นครีบหางเว้าลึก ปลากาดำขนาดใหญ่นิยมนำมาบริโภคเนื่องจากมีรสชาติดีลูกปลาขนาดเล็กนิยมเลี้ยงเป็นปลาสวยงาม ขนาดเฉลี่ยความยาวประมาณ 25 ซม.', 'ตะไคร่น้ำ พืชน้ำขนาดเล็ก ซากพืช แพลงก์ตอนสัตว์และตัวอ่อนแมลง', 'ปลาขนาดเล็กนิยมเลี้ยงเป็นปลาสวยงามในตู้ที่มีพรรณไม้น้ำเลี้ยงรวมกับปลาชนิดอื่น อุปนิสัยชอบดูดกินตะไคร่ที่เกาะตามพื้นก้นตู้ก้อนหินและใบไม้'),
(8, 'หัวตะกั่ว', 'Blue-panchax', 'ลำตัวค่อนข้างกลม ยาวเรียว ลำตัวด้านหลัง สีน้ำตาลอ่อน ขอบนอกของเกล็ด มีสีน้ำตาลเข้ม บริเวณกลางหัวมีจุดสีขาวเงินขนาดใหญ่ 1 จุด ขนาดเฉลี่ยความยาวประมาณ 4 ซม.', 'ตัวอ่อนแมลงน้ำ', 'เป็นปลาขนาดเล็ก เลี้ยงในตู้ขนาดเล็กที่มีพรรณไม้น้ำ'),
(9, 'เสือดำ', 'Bornean-leaf-fish', 'ลำตัวแบนข้าง หัวโต ตาโต จะงอยปากมน บนแผ่นปัดเหงือกมีหนามเล็กๆ 1 อัน เกล็ดใหญ่ตัวมีสีน้ำตาลแดง มีลายบั้งและประสีคล้ำพาดขวางลำตัว 5-6 บั้ง มีแถบสีดำพาดตั้งแต่ปลายปากถึงท้ายทอยครีบหลังตอนแรกสีเหมือนลำตัวตอนหลังใสมีจุดสีคล้ำกระจายเช่นเดียวกับครีบหางและครีบก้นตอนท้ายครีบอกใสครีบท้องและครีบก้นตอนหน้าสีคล้ายของลำตัว ขนาดใหญ่สุดมีความยาวประมาณ 10 ซม. ขนาดเฉลี่ยความยาวประมาณ 7 ซม.', 'ไรน้ำ สัตว์น้ำขนาดเล็ก', 'เลี้ยงในตู้ปลาขนาดเล็ก ตกแต่งด้วยก้อนหิน อุปนิสัยชอบอยู่นิ่ง ๆ หลบซ่อนตัวอยู่ตามก้อนหิน'),
(10, 'น้ำผึ้ง', 'Chinese-algae-eater', 'ลำตัวยาวเรียวรูปร่างทรงกระบอก ลำตัวมีสีน้ำตาล บริเวณหลังมีจุดแต้มสีดำหรือสีน้ำตาลเข้ม ส่วนหัวสั้น ด้านล่างของส่วนหัวและส่วนท้องแบนราบ ไม่มีหนวด ตาอยู่ค่อนไปทางด้านบนของส่วนหัว จะงอยปากค่อนข้างยาวและกว้าง บริเวณจะงอยปากมีตุ่มเล็ก ๆ กระจายทั่วไปปากดัดแปลงเป็นอวัยวะสำหรับเกาะติดกับสิ่งอื่นได้ ครีบทุกครีบไม่มีก้านครีบแข็งครีบมีสีเหลืองอมน้ำตาลและมีจุดดำเล็ก ๆ กระจายอยู่ทั่วไปครีบหางเว้าเล็กน้อยขนาดเฉลี่ยความยาวประมาณ 13 ซม. ขนาดใหญ่สุดความยาวประมาณ 20 ซม.', 'ตะไคร่น้ำ', 'เลี้ยงในตู้ปลาที่ตกแต่งด้วยพรรณไม้น้ำหรือตู้พรรณไม้น้ำ อุปนิสัยการชอบใช้ปากดูดกินตะไคร่น้ำที่เกาะตามตู้ปลา ปัจจุบันมีการคิดสายพันธุ์เป็นปลาเผือกซึ่งได้รับความนิยมมากเรียกว่า “ น้ำผึ้งเผือก ” เป็นปลาสวยงามที่ได้รับความนิยมสูงในตลาดต่างประเทศ'),
(11, 'กราย', 'Clown-featherback', 'ลำตัวบางแบนข้างมากและยาวเรียวไปทางส่วนหางคล้ายใบมีด ส่วนหัวมีขนาดเล็กและแยกจากลำตัวเห็นชัดเจน รอยเว้าบริเวณต้นคอมีมากกว่าปลาชนิดอื่นในสกุลเดียวกันนี้ ปากค่อนข้างกว้าง มุมปากอยู่เลยหลังขอบตาออกไปมาก ลำตัวบริเวณหลังสีคล้ำ ด้านข้างลำตัวมีสีน้ำเงินหรือสีเงินปนเทา ส่วนหัวและส่วนหลังมีสีคล้ำกว่าส่วนท้องเหนือครีบก้นมีจุดดำขนาดใหญ่เรียงขนานไปกับครีบก้นประมาณ 5-10 จุด ในปลาขนาดเล็กจะมีแถบสีดำพาดขวางลำตัวประมาณ 10-15แถบ และแถบเหล่านี้จะหายไปเมื่อปลาโตขึ้นและมีจุดเกิดขึ้นแทนเกล็ดมีขนาดเล็กละเอียด ครีบต่าง ๆ ทุกครีบเป็นก้านครีบอ่อนทั้งหมดครีบก้นยาวมากและติดต่อกับครีบหางเป็นอันเดียวกัน ครีบหลังเล็กตั้งอยู่ประมาณกึ่งกลางหลังลักษณะคล้ายขนนกเสียบอยู่ ขนาดใหญ่สุดความยาวประมาณ 75 ซม.', 'ตัวอ่อนแมลงน้ำ กุ้ง และลูกปลาขนาดเล็กที่อาศัยบริเวณผิวน้ำ', 'เลี้ยงในตู้ปลาขนาดใหญ่ที่ตกแต่งด้วยขอนไม้และพรรณไม้น้ำ หากเลี้ยงเป็นฝูงเล็กต้องมีขนาดไล่เลี่ยกัน ปลากรายขนาดเล็กเป็นปลาสวยงามที่ส่งออกจำหน่ายยังต่างประเทศ ปัจจุบันมีการคัดสายพันธุ์เป็นปลาเผือกซึ่งได้รับความนิยมเรียกว่า “กรายเผือก”'),
(12, 'น้ำเงิน', 'Common-sheathfish', 'เป็นปลาไม่มีเกล็ดขนาดกลาง ลำตัวเรียวยาว แบนข้างและเพรียวยาวไปทางด้านท้าย พื้นลำตัวสีขาวเงิน ส่วนหลังมีสีดำอมเขียว หัวแบนสั้นและตาเล็ก ปากค่อนข้างกว้างมีฟันแหลมคมอยู่บนขากรรไกรทั้งสองข้าง ครีบหูใหญ่ปลายมน ครีบท้องมีขนาดเล็ก ครีบก้นเป็นแผงยาวแต่ไม่มีครีบหลัง สันหลังบริเวณต้นคอสูงและลาดต่ำลงไปทางปลายหาง ครีบหางยาวเป็นแฉกเว้าลึก ขนาดใหญ่สุดความประมาณ 1.5 เมตร มักพบอยู่รวมกันเป็นฝูงในระดับกลางน้ำ', 'ไรน้ำ แพลงก์ตอนสัตว์ ลูกปลาขนาดเล็ก', 'เลี้ยงในตู้ที่ตกแต่งด้วยก้อนหิน ขอนไม้และพรรณไม้น้ำ'),
(13, 'ปล้องอ้อย', 'Coolie-loach', 'ลำตัวกลมยาว ขนาดเล็กคล้ายหนอน สีลำตัวเป็นสีน้ำตาลหรือเทาดำมีสีเหลืองทองพาดขวางอยู่ตามลำตัวเป็นปล้อง ๆ คล้ายงู ครีบใสโคนครีบหางและครีบก้นมีสีดำ ขนาดเฉลี่ยความยาวประมาณ 5 ซม.', 'แพลงก์ตอน ไรน้ำ ตัวอ่อนแมลงน้ำ', 'เลี้ยงในตู้ขนาดเล็กร่วมกับปลาชนิดอื่นที่ไม่ก้าวร้าว ตกแต่งตู้ด้วยก้อนหินหรือขอนไม้อุปนิสัยมักหลบตามที่หลบซ่อน'),
(14, 'กระดี่นางฟ้า', 'Cosby-strain', 'ลำตัวแบนข้างมาก เกล็ดมีขนาดเล็กละเอียด พื้นลำตัวมีสีฟ้าสลับด้วยลวดลายสีฟ้าอมน้ำเงินจนถึงดำ ครีบอกมีลักษณะเรียวยาวคล้ายหนวดครีบหลังและครีบทวารมีก้านครีบที่แหลมคม ขนาดเฉลี่ยความยาวประมาณ 12 ซม.', 'แพลงก์ตอนพืช พืชน้ำขนาดเล็ก ตัวอ่อนแมลงน้ำทั้งที่มีชีวิตและไม่มีชีวิต', 'เลี้ยงในตู้ที่มีพรรณไม้น้ำ เป็นปลาที่มีความปราดเปรียวและปรับตัวเข้ากับสภาพแวดล้อมได้ดีได้รับความนิยมเลี้ยงเป็นปลาสวยงามเพราะมีสีสวยงาม'),
(15, 'กริมควาย', 'Croaking-gourami', 'ส่วนหัวค่อนข้างเรียว ปากเล็กเชิดขึ้นเล็กน้อย ลำตัวรูปไข่ทรงเรียวแบนข้างเล็กน้อย ครีบหลังอยู่ตอนกึ่งกลาง ครีบหางปลายแหลมยาวในตัวผู้ครีบก้นยาว ครบท้องเล็กมีปลายเรียวยาว เกล็ดใหญ่ไม่มี เส้นข้างตัวลำตัวมีสีคล้ำอมน้ำตาลหรือน้ำตาลแดง มีแต้มกลมสีคล้ำที่เหนือครีบอกมีเหลือบสีเขียวอ่อนและมีจุดประสีแดงที่ครีบ ครีบก้นมีขอบสีแดงคล้ำมีเหลือบสีเขียวอ่อนหรือฟ้าตามครีบในตัวผู้ตามีสีฟ้าที่ม่านตาขนาดใหญ่สุดความยาวประมาณ 7 ซม.', 'แพลงก์ตอนพืช พืชน้ำขนาดเล็ก ตัวอ่อนแมลงน้ำทั้งที่มีชีวิตและไม่มีชีวิต', 'เลี้ยงในตู้ขนาดเล็ก ที่ตกแต่งด้วยพรรณไม้น้ำ'),
(16, 'ซิวข้าวสาร', 'Dwarf-medaka', 'มีรูปร่างลำตัวยาวเรียว ตาโต จะงอยปากเรียว ปากเล็ก ครีบมีขนาดเล็ก ตัวใสมีสีน้ำตาลอ่อน ส่วนรอบตาและท้องมีเหลือบสีฟ้าเงิน ตัวผู้มักมีขนาดเล็กกว่าตัวเมีย ขนาดใหญ่สุดความยาวประมาณ 1.8 ซม. ขนาดเฉลี่ยความยาวประมาณ 1.5 ซม. ถูกจับรวบรวมเป็นปลาสวยงาม เป็นครั้งคราว ใช้ชื่อการค้าว่า Blue eye Rice fish หรือ Medaka', 'แพลงก์ตอน', 'เป็นปลาขนาดเล็ก เลี้ยงเป็นฝูงในตู้ที่มีพรรณไม้น้ำ'),
(17, 'ซิวเพชรน้อย', 'Dwarf-rasbora', 'รูปร่างเรียวยาว หัวโต ปากเล็ก ตาโต เกล็ดค่อนข้างใหญ่ เส้นข้างลำตัวไม่สมบูรณ์ ครีบอกเล็ก ครีบก้นค่อนข้างใหญ่ ครีบหางเว้าลึก ตัวมีสีน้ำตาลอ่อนถึงสีแดงส้ม มีดวงสีคล้ำที่เหนือครีบอก ครีบก้น และจุดสีดำที่โคนหาง ครีบก้น ครีบหลังมีแต้มสีแดงสดและประสีคล้ำขนาดใหญ่สุดความยาวประมาณ 2 ซม.', 'แพลงก์ตอนสัตว์ขนาดเล็ก', 'เลี้ยงเป็นฝูงในตู้ปลาขนาดเล็กที่มีพรรณไม้น้ำ เป็นปลาสวยงามที่แปลกแต่เลี้ยงได้ยากต้องปรับคุณภาพน้ำให้มีลักษณะใกล้เคียงกับน้ำในป่าพรุ ไม่เปลี่ยนถ่ายน้ำบ่อยจนเกินไป'),
(18, 'แรด', 'Giant-gourami', 'ลำตัวลึกและแบนข้างมาก หัวค่อนข้างเล็ก จะงอยปากแหลม ขากรรไกรล่างยื่นกว่าขากรรไกรบนเล็กน้อย มีฟันซี่เล็ก ๆ บนขากรรไกรบนและล่างครีบหลังและครีบก้นยาวมาก มีเกล็ดบนฐานครีบ ความสูงของก้านครีบบริเวณตอนปลายของครีบทั้งสองจะสูงกว่าตอนต้นของครีบ ครีบท้องมีก้านครีบแข็ง 1 อัน ก้านครีบอ่อน 5 อัน ก้านครีบอ่อนอันแรกของครีบท้องมีลักษณะเป็นเส้นยาว อาจจะยาวถึงหรือยาวเลยปลายครีบหางครีบหางกลม ขนาดเฉลี่ยความยาวประมาณ 30 ซม.', 'แพลงก์ตอนพืช แพลงก์ตอนสัตว์พันธุ์ไม้น้ำและซากพืชที่เน่าเปื่อย', 'เลี้ยงในตู้ขนาดใหญ่ ตกแต่งด้วยขอนไม้'),
(19, 'ช่อนงูเห่า', 'Great-snakehead', 'ลำตัวยาวเรียวรูปทรงกระบอกส่วนหัวจะเรียวแหลมกว่าปลาช่อน สีลำตัวจะแตกต่างกันออกไปตามอายุและสภาพแวดล้อมที่ปลาอาศัยอยู่โดยทั่วไปมักมีสีคล้ำ เช่น ดำ น้ำตาลอมเทาหรือเทาอมเขียว ในขณะปลาอายุจะมีแถบสีส้มสดพาดไปตามความยาวลำตัวถึงโคนหาง เมื่อปลาเจริญขึ้นอีกระยะหนึ่งจะมีแถบสีดำ 5-6 แถบอยู่บริเวณใต้เส้นข้างตัวบริเวณท้องจะมีส้มบริเวณฐานะเกล็ดจะมีสีคล้ำ  บริเวณส่วนท้ายของลำตัว ครีบหางและครีบก้นจะมีจุดสีขาว บริเวณโคนครีบหางหรือส่วนต้นของครีบหางมีจุดสีดำที่มีขอบขาวขนาดใหญ่ ซึ่งเป็นลักษณะเด่นของปลาชนิดนี้และทำให้ได้ชื่อว่า “ช่อนดอกจันทร์” ครีบหลังและครีบก้นมีฐานครีบยาว ครีบหางกลม ขนาดเฉลี่ยความยาวประมาณ 35 ซม.', 'สัตว์น้ำอื่น ๆ ที่มีขนาดเล็กกว่า', 'เลี้ยงในตู้ขนาดใหญ่ที่ตกแต่งด้วยก้อนหินขอนไม้อุปนิสัยชอบนอนนิ่ง ๆบนขอนไม้'),
(20, 'ปักเป้าเขียวจุด', 'Green-blow-fish', 'เป็นปลาน้ำจืดขนาดเล็ก นิสัยค่อนข้างดุร้าย มีสารพิษในอวัยวะสืบพันธุ์และระบบย่อยอาหาร ไม่นิยมบริโภค ลำตัวค่อนข้างกลม หัวโตตาเล็ก ลำตัวสีเขียวมะกอก ท้องสีขาวจาง มีจุดประสีดำอยู่ตอนบนของลำตัว ขนาดเฉลี่ยความยาวประมาณ 6 ซม.', 'กุ้ง หอย แมลงน้ำ', 'เลี้ยงในตู้ขนาดเล็กที่ตกแต่งด้วยก้อนหินและพรรณไม้น้ำ นิยมนำมาเลี้ยงเพื่อให้กินหอยที่ติดมากับพรรณไม้น้ำและแพร่พันธุ์ในตู้ปลา หรือเลี้ยงเพื่อให้กินหอยในบ่อชำน้ำของพรรณไม้น้ำ'),
(21, 'กระสูบขีด', 'Hampala-barb', 'รูปร่างกลมเพรียวยาวแบนข้างเล็กน้อย ด้านข้างลำตัวมีแถบขวางบริเวณใต้ครีบหลังลงมาถึงท้อง ลำตัวสีขาวเงินส่วนหลังมีสีคล้ำ ครีบมีสีแดงเรื่อ ขอบบนและขอบล่างของครีบหางมีแถบสีคล้ำขนาดเฉลี่ยความยาวประมาณ 25 ซม. ในปลาขนาดเล็กมีแถบ 2 แถบที่กลางลำตัวและโคนหาง และมีแถบใต้ตาด้วย', 'ปลาขนาดเล็ก', 'เลี้ยงเป็นฝูงในตู้ปลาขนาดกลาง ว่ายน้ำรวดเร็ว มีสีสันสวยงาม อุปนิสัยค่อนข้างก้าวร้าว เลี้ยงรวมกับพันธุ์ปลาชนิดอื่นที่มีขนาดใกล้เคียงกันได้'),
(22, 'รากกล้วย', 'Horseface-loach', 'แม่น้ำ ลำตัวยาวเรียวแบนข้างเล็กน้อย ลำตัวสีน้ำตาลอ่อน ท้องสีขาวตามแนวสันหลังมีแถบสั้น ๆ สีน้ำตาลดำพาดขวางประมาณ 10 แถบ ตามแนวเส้นข้างตัวมีแถบสีน้ำตาลขนาดเล็กพาดไปตามความยาวลำตัวข้างละ 1 แถบ มีจุดสีน้ำตาล 8-12 จุด เรียงไปตามความยาวของแนวเส้นข้างตัว หัวมีขนาดใหญ่เรียวแหลมและแบนข้าง ตามีขนาดเล็กอยู่ค่อนไปทางด้านบนของส่วนหัว บริเวณหน้าตามีหนามแหลมเล็ก ๆ ปลายแยกเป็นสองแฉกซ่อนอยู่ในร่องใต้ผิวหนัง จะงอยปากค่อนข้างยาวแหลมและงุ้มต่ำ มีหนวดสั้น ๆ 3 คู่ ครีบหลังและครีบหางมีสีน้ำตาลอ่อน ครีบอื่น ๆ ใสไม่มีสีครีบต่าง ๆ ไม่มีก้านครีบแข็งครีบหลังมีก้านครีบเดี่ยว 3-4 อัน ก้านครีบแขนง 10 อัน ครีบก้นมีขนาดเล็ก ครีบหางเว้าไม่ลึก 8-10 ซม. ขนาดใหญ่สุดความยาวประมาณ 25 ซม.ลำธารหรืออ่างเก็บน้ำทุกภาคของประเทศไทย ประเทศมาเลเซีย อินโดนีเซียและพม่า', 'แพลงก์ตอน ไรน้ำ ตัวอ่อนแมลงน้ำ', 'เลี้ยงในตู้ขนาดเล็กร่วมกับปลาชนิดอื่นที่ไม่ก้าวร้าวอุปนิสัยชอบนอนนิ่งๆบนพื้นทราย'),
(23, 'ยี่สกไทย', 'Isok-barb', 'ลำตัวยาวเรียวแบนข้างเพียงเล็กน้อยเกล็ดบริเวณลำตัวจะมีสีเหลืองนวลหรือเหลืองทองและมีแถบสีน้ำตาลดำพาดไปตามความยาวลำตัว 6-8 แถบ สีบริเวณหัวเป็นสีเหลืองแกมเขียว ปากอยู่ต่ำ ริมฝีปากยืดหดได้มีฟันในคอหอย มีหนวดสั้นที่ขากรรไกรบน 1 คู่ ครีบอก ครีบท้องและครีบก้นเป็นสีชมพูครีบหางสีดำ เป็นปลาที่มีขนาดใหญ่รองลงมาจากปลากระโห้ ขนาดเฉลี่ยความยาวประมาณ 80 ซม. น้ำหนักเฉลี่ย 6 -18 กก. ขนาดใหญ่สุดพบมีความยาวประมาณ 120 ซม.', 'หอย ปู พืชน้ำ และตะไคร่น้ำ', 'เลี้ยงเป็นฝูงในตู้ปลาขนาดใหญ่ อุปนิสัยชอบอมกรวดขนาดเล็กตามพื้นตู้แล้วพ้นออกมา และชอบยืดหดริมฝีปากบ่อย ๆ'),
(24, 'หมอแคระแม่น้ำแคว', 'Khwae-badis', 'ลักษณะลำตัวเพรียวยาว แบนข้าง หัวเล็ก นัยน์ตาเล็ก พื้นลำตัวสีน้ำตาลอมขาว มีแถบสีน้ำตาลเข้มพาดขวางลำตัว ครีบหลังและครีบก้นยาวเลยโคนหาง ครีบทุกครีบมีสีเหลืองอมส้มครีบหลังมีแถบสีดำตามความยาวครีบ และมีแต้มสีดำบริเวณโคนครีบ ขอบครีบขาว ครีบก้นมีลักษณะคล้ายครีบหลังแต่ไม่มีแต้มสีดำ ครีบหางกลมปลายตัด มีแถบสีดำพาดขวาง โคนครีบหางมีจุดสีดำขนาดใหญ่ 1 จุด ขนาดเฉลี่ยความยาวประมาณ 3 ซม.', 'สัตว์น้ำขนาดเล็ก แมลงน้ำ', 'เป็นปลาขนาดเล็ก เลี้ยงในตู้ขนาดเล็กที่มีพรรณไม้น้ำ'),
(25, 'หมอตาล', 'Kissing-gourami', 'รูปร่างป้อมสั้น ลำตัวแบน หัวเล็ก จะงอยปากสั้นทู่ ปากเล็กยืดหดได้ริมฝีปากหนา นัยน์ตาอยู่ในระดับเดียวกันกับมุมปาก มีเกล็ดขนาดปานกลางปกคลุมส่วนหัวและลำตัว ครีบท้องและครีบก้นยาว ลำตัวเป็นสีเขียวปนเทา หลังสีเทาปนดำ ท้องสีขาว ขนาดใหญ่ดความยาวประมาณ 20 ซม.', 'สาหร่าย ไรน้ำและแมลงต่าง ๆ', 'เลี้ยงในตู้ปลาขนาดกลาง ตกแต่งด้วยก้อนหินและขอนไม้'),
(26, 'บู่กล้วย', 'Knight-Goby', 'ลำตัวค่อนข้างกลม หางแบน หัวโต นัยน์ตามีขนาดใหญ่ ลำตัวมีสีน้ำตาลอ่อนอมเหลือง ลำตัวมีจุดแต้มสีดำหรือสีน้ำตาลเข้ม มีจุดประสีเข้มขนาดเล็กกระจายอย่างไม่เป็นระเบียบทั่วทั้งลำตัว ครีบหลังยาวแบ่งเป็นสองตอน ตอนหน้าเป็นเส้นยาว ตอนหลังแผ่กางมีจุดประสีดำกระจายทั่วอย่างเป็นระเบียบ ครีบหางใหญ่ปลายมนมีจุดประสีเข้มกระจายทั่ว ครีบท้องมีจุดประ ครีบอกใส อุปนิสัยชอบนอนนิ่ง ๆ แผ่ครีบกางออกอวดสีสันสวยงาม ขนาดเฉลี่ยความยาวประมาณ 6 ซม.', 'ไรน้ำ แพลงก์ตอนสัตว์ ตัวอ่อนแมลงน้ำ', 'เลี้ยงในตู้ปลาขนาดเล็กที่มีพรรณไม้น้ำ เป็นปลาสวยงามที่หายากในปัจจุบัน'),
(27, 'ค้อหางแดง', 'Loach', 'ลำตัวเพรียวยาว พื้นลำตัวขาวขุ่น มีแถบสีดำตามขวางของลำตัว 8-10 แถบ ส่วนหัวด้านบนมีจุดประสีเข้มกระจายทั่วครีบหางเว้าตื้นสีแดงครีบหลังสีเหลืองอ่อนมีจุดแดงใต้ครีบ ครีบอื่น ๆสีเหลืองอ่อน ขนาดเฉลี่ยความยาวประมาณ 10 ซม.', 'แพลงก์ตอนสัตว์ ตัวอ่อนแมลงน้ำ', 'เลี้ยงในตู้ขนาดเล็กร่วมกับปลาชนิดอื่น ตกแต่งตู้ด้วยกรวดแม่น้ำและก้อนหิน อุปนิสัยชอบนอนนิ่ง ๆ บนพื้นกรวด'),
(28, 'หมูน่าน', 'Mekong-clawn-loach', 'มีรูปร่างและสีสันคล้ายคลึงปลาหมูอารีย์ (Y. sidthimunki) ซึ่งเป็นปลาที่อยู่ในสกุลเดียวกัน แต่ปลาหมูน่านลายจะเป็นแถบยาว เมื่อปลามีขนาดใหญ่ขึ้น ลายตามยาวจะขาดเป็นท่อน ๆ และจะเกิดลายขวางเพิ่มมากขึ้น โดยที่ลายแถบของปลาหมูน่านจะมีราว 8-10 แถบ ในขณะที่ปลาหมูอารีย์จะมีแค่ 5-8 แถบ ดังนั้นเมื่อมองด้วยตาเปล่าแล้วจะพบว่า ลายเส้นของปลาหมูน่านจะใหญ่และหนากว่าของปลาหมูอารีย์อีกทั้งเมื่อโตเต็มที่แล้วจะมีขนาดลำตัวใหญ่กว่าปลาหมูอารีย์ คือ ขนาดเฉลี่ยความยาวประมาณ 10 ซม.', 'ตัวอ่อนแมลงน้ำ หนอนและซากสัตว์', 'เลี้ยงในตู้ขนาดเล็กร่วมกับปลาชนิดอื่นได้ ตกแต่งตู้ด้วยก้อนหินหรือขอนไม้อุปนิสัยมักหลบตามที่หลบซ่อน วัสดุตกแต่งไม่ควรมีรูขนาดเล็กเมื่อปลาตกใจจะมุดเข้าไปติดแล้วออกไม่ได้'),
(29, 'เฉี่ยวหิน', 'Moon-fish', 'รูปร่างแบน ลำตัวแบนข้างมาก หัวเล็ก ปากเฉียงขึ้น ฟันเล็กละเอียด นัยน์ตาโต ครีบหลังและครีบก้นตั้งอยู่ในแนวเดียวกัน พื้นลำตัวสีขาวเงิน ด้านหลังมี สีเขียวแกมเหลือง มีแถบดำพาดผ่านตา ครีบหลังเหลืองหรือส้มขอบคล้ำ ครีบก้นมีแถบดำ ครีบหางมีสีเหลืองจางๆ ขนาดเฉลี่ยความยาวประมาณ 22 ซม.', 'กุ้ง แมลง', 'เลี้ยงในตู้ปลาขนาดกลาง ตกแต่งด้วยก้อนหินและขอนไม้'),
(30, 'กระดี่นาง', 'Moonlight-gourami', 'รูปร่างคล้ายคลึงกับปลากระดี่หม้อแต่ขนาดโดยเฉลี่ยจะโตกว่า บริเวณลำตัวและครีบเรียบไม่มีลาย เกล็ดบริเวณลำตัวเป็นสีขาวเงิน หรือสีฟ้าอ่อน ครีบสีขาว เกล็ดด้านข้างลำตัวมีขนาดเล็ก ครีบท้องมีก้านครีบอันแรกเปลี่ยนเป็นเส้นยาว ครีบก้นยาว ครีบหางเว้าตื้น ขนาดโดยเฉลี่ยประมาณ 13 ซม. ปลาตัวผู้สังเกตได้จากขอบครีบท้องและขอบครีบก้นจะมีสีส้ม', 'แพลงก์ตอน พืชน้ำขนาดเล็ก ตัวอ่อนแมลงน้ำ และซากพืชที่เน่าเปื่อย', 'เลี้ยงในตู้ที่มีพรรณไม้น้ำ'),
(31, 'ปักเป้าดำ', 'Pao-leiurus', 'รูปร่างกลมป้อมหัวท้ายเรียว ปากเล็ก ตาโต ด้านหลังและด้านท้องมีผิวสากเป็นหนามเล็กละเอียด ด้านท้องนิ่มขยายตัวได้มาก ครีบหลังเล็กเช่นเดียวกับครีบก้น ลำตัวสีเขียวอมเทาคล้ำหรือสีน้ำตาลเข้ม มีดวงหรือลายสีดำประทั่วตัว บางตัวอาจมีสีจางที่ด้านท้อง ตาแดง ครีบสีจางขนาดใหญ่สุดความยาวประมาณ 13 ซม.', 'กุ้ง หอย แมลงน้ำ', 'เลี้ยงในตู้ขนาดเล็กที่ตกแต่งด้วยก้อนหินและพรรณไม้น้ำ'),
(32, 'หนวดพราหมณ์', 'Paradise-thread-fin', 'มีส่วนหัวขนาดเล็ก ตามีขนาดเล็กอยู่เกือบสุดปลายส่วนหัวและมีเยื่อไขมันคลุม ปากกว่างมีฟันซี่เล็กละเอียดบนขากรรไกร ลำตัวแบนข้างครีบอกยาว ส่วนที่เป็นเส้นยาวมีความยาวมากกว่าลำตัวถึง 2 เท่าโดยเฉพาะเส้นบนมีทั้งหมดข้างละ 10 เส้น ครีบหางเว้าลึกปลายแหลมเกล็ดเล็กละเอียดมีลักษณะเป็นปากฉลาม ตัวมีสีเงินวาวอมชมพูหรือสีเนื้อ หัวสีจางอมชมพูหรือสีเนื้อ ครีบสีจาง ด้านท้องสีจาง ขนาดเฉลี่ยความยาวประมาณ 12 ซม. ขนาดใหญ่สุดความยาวประมาณ 20 ซม.', 'สัตว์น้ำขนาดเล็ก ตัวอ่อนแมลงน้ำ', 'เลี้ยงในตู้ขนาดใหญ่ เพราะต้องการพื้นที่ในการว่ายน้ำมาก เป็นปลาสวยงามที่มีความโดดเด่นบริเวณครีบอกที่เป็นเส้นยาวออกมา ตลาดต่างประเทศมีความต้องการแต่ยังมีปัญหาเรื่องการขนส่งที่ต้องใช้ความละเอียดอ่อนและความระมัดระวังในการส่งออก'),
(33, 'กระดี่มุก', 'Pearl-gourami', 'ลำตัวเพรียวยาวและแบนข้างมาก พื้นลำตัวมีสีน้ำตาล ตามตัวมีจุดสีขาวประกระจายอยู่ทั่วไป ที่กลางลำตัวจากปากจรดโคนหางมีแถบสีดำคาดตามความยาวลำตัว โคนหางมีจุดดำข้างละ 1 จุด ครีบมีลักษณะเรียวยาวคล้ายหนวด เกล็ดมีขนาดเล็กละเอียด ขนาดเฉลี่ยความยาวประมาณ 12 ซม.', 'แพลงก์ตอน พืชน้ำขนาดเล็ก ตัวอ่อนแมลงน้ำ และซากพืชที่เน่าเปื่อย', 'เลี้ยงในตู้ที่มีพรรณไม้น้ำ เป็นปลาสวยงามที่ได้รับความนิยมสูงเพราะมีสีสันสวยงาม มีการจัดประกวดทั้งในประเทศ (งานประมงน้อมเกล้าฯ)และต่างประเทศ เช่นในงาน Aquarama ประเทศสิงคโปร์ ปัจจุบันมีการคัดพันธุ์ให้มีลักษณะลำตัวสั้น หรือ shortbody ซึ่งกำลังเป็นที่นิยมในวงการปลาสวยงาม'),
(34, 'ช่อนเข็ม', 'Pikehead', 'รูปร่างคล้ายปลาช่อนแต่ส่วนหัวและจะงอยปากแหลมยื่นจะงอยปากล่างยาวกว่าปากบน ตาโต เกล็ดใหญ่ ครีบหลังอันเล็กมีฐานสั้นอยู่ค่อนไปทางด้านท้ายใกล้กับคอดหาง ครีบหางมีปลายมน ครีบก้นมีฐานยาวแบ่งออกเป็นสองตอนโดยเว้าที่ตอนกลาง ครีบท้องเล็กมีก้านครีบอันแรกยาวเป็นเส้น ครีบอกเล็ก ตัวมีสีน้ำตาลไหม้หรือน้ำตาลอมเขียวด้านหลังมีสีจางกว่าตอนกลางมีแถบใหญ่สีคล้ำขอบสีจางพาดจากจะงอยปากไปถึงโคนครีบหางและมีแถบสีจางพาดบริเวณด้านท้องโคนครีบหางมีจุดจางสีดำขอบขาว ด้านท้องสีจาง ครีบหลังมีสีคล้ำครีบหางมีลายสีคล้ำประ ครีบด้านล่างใส ว่ายอยู่ใกล้ผิวน้ำเป็นกลุ่มเล็ก ๆ 5-10 ตัว หรือลอยอยู่เหนือใบไม้เพื่อนรอเหยื่อ ขนาดใหญ่สุดความยาวประมาณ 20 ซม.', 'แมลง สัตว์น้ำขนาดเล็ก', 'เลี้ยงในตู้ขนาดเล็ก ตกแต่งด้วยขอนไม้และพรรณไม้น้ำ เป็นปลาที่เลี้ยงค่อนข้างยาก ถูกรวบรวมเพื่อส่งออกเป็นจำนวนมากเช่นกันจากพรุโต๊ะแดง'),
(35, 'กาแดง', 'Red-finned-shark', 'ลักษณะทั่ว ๆ ไป คล้ายปลาทรงเครื่องมาก แตกต่างกันคือลำตัวค่อนข้างยาวเรียวกว่า เมื่อเปรียบเทียบปลาที่มีขนาดเดียวกัน ลำตัวมีสีน้ำตาลอมเทาไม่ดำเข้มเหมือนปลาทรงเครื่อง ครีบทุกครีบสีส้มอมแดงบริเวณด้านข้างหัวทั้ง 2 ข้าง มีแถบสีดำพาดตามยาวจากปลายปากไปถึงตา โคนหางมีจุดสีดำรูปไข่ข้างละ 1 จุด ขนาดเฉลี่ยความยาวประมาณ 10 ซม.', 'สารอินทรีย์เล็ก ๆ ตะไคร่น้ำ และตัวอ่อนแมลงน้ำขนาดเล็ก', 'เลี้ยงร่วมกับปลาชนิดอื่นในตู้ปลาที่มีพรรณไม้น้ำ อุปนิสัยชอบและเล็มกินตะไคร่น้ำและเศษสารอินทรีย์ในตู้ปลา ลักษณะคล้ายกับปลาทรงเครื่องแต่รูปร่างและสีสันเด่นน้อยกว่าปลาทรงเครื่อง ปัจจุบันมีการคัดสายพันธุ์เป็นปลาเผือกซึ่งได้รับความนิยมเรียกว่า “กาแดงเผือก ” ได้รับความนิยมสูง'),
(36, 'ตะเพียนทอง', 'Red-tinfoil-barb', 'ลักษณะลำตัวแบนข้างและกว้าง บริเวณกระพุ่งแก้มและบริเวณลำตัวโดยเฉพาะบริเวณท้องจะมีสีเหลืองเห็นได้ชัดเจน มีหนวด 2 คู่ ครีบหลังบริเวณโคนครีบมีสีเทา ส่วนปลายเป็นสีเทาอมดำไม่ดำเข้ม เช่น ปลากระแห ครีบท้องและครีบก้นสีแดงสด ครีบอกสีเหลือง ครีบหางสีแดงอ่อน บริเวณขอบบนและขอบล่างของครีบหางมีสีเทา ไม่เห็นเป็นขอบสีดำชัดเจนเช่นปลากระแห ขนาดใหญ่สุดความยาวประมาณ 25 ซม. ขนาดเฉลี่ยความยาวประมาณ 15 ซม.', 'พรรณไม้น้ำ แพลงก์ตอนพืช แพลงก์ตอนสัตว์และตัวอ่อนแมลงน้ำ', 'เลี้ยงเป็นฝูงในตู้ปลาขนาดใหญ่ร่วมกับปลาชนิดอื่น ๆ ตกแต่งตู้โดยใช้ก้อนหินหรือขอนไม้ ไม่นำพรรณไม้นำมาตกแต่งเพราะเป็นปลาที่ชอบกินพืชปัจจุบันมีการคัดพันธุ์จนได้พันธุ์เผือกสีทองทั้งตัว เรียกชื่อทางการค้าว่า “ตะเพียนทองเผือก” ได้รับความนิยมสูง'),
(37, 'เล็บมือนาง', 'Siamese-algae-eater', 'มีรูปร่างลำตัวเพรียว หัวเล็ก ปากเล็กอยู่ด้านล่างของจะงอยปากและมีแผ่นหนังคลุม มีหนวดสั้น 1 คู่ เกล็ดเล็ก ลำตัวสีเงินอมเหลืองมีลายสีคล้ำที่ขอบเกล็ด โคนครีบหางมีจุดสีดำเห็นชัดเจน ครีบใสสีเหลืองเรื่อ ๆ ขนาดเฉลี่ยมีความยาว 8-10 ซม. ขนาดใหญ่สุดพบความยาวประมาณ 17 ซม.', 'แพลงก์ตอนพืชและแพลงก์ตอนสัตว์ ตะไคร่น้ำ', 'เลี้ยงร่วมกับปลาชนิดอื่นในตู้ปลาที่มีพรรณไม้น้ำ อุปนิสัยชอบและเล็มกินตะไคร่น้ำและเศษใบไม้ในตู้ปลา คล้ายกับปลาน้ำผึ้ง'),
(38, 'กัด', 'Siamese-fighting-fish', 'ลำตัวทรงกระบอกและแบนข้างเล็กน้อย หัวสั้น ปากเล็ก ครีบหางใหญ่และปลายกลม ครีบท้องเป็นเส้นยาว ลำตัวสีน้ำตาลอ่อนเหลือบแดงน้ำเงิน หรือเขียว ครีบสีแดงมีแถบสีเหลืองประ ตัวผู้สีสันสดใสกว่าตัวเมีย ปัจจุบันมีการคัดพันธุ์จนมีลักษณะครีบ และสีที่หลากหลายได้รับความนิยมสูงในตลาดต่างประเทศ เช่น ประเภทสองหางหางมงกุฎ หางพระจันทร์ครึ่งเสี้ยว หรือประเภทสองสีและหลายสีเป็นต้น ขนาดเฉลี่ยความยาวประมาณ 5 ซม.', 'ไรน้ำ ลูกน้ำ ตัวอ่อนแมลงน้ำ', 'เป็นปลาสวยงามที่นิยมเลี้ยงเฉพาะตัวผู้เนื่องจากลำตัวและครีบต่าง ๆมีสีสันสวยงาม เลี้ยงในโหลขนาดเล็กโหลละตัว หากวางโหลใกล้กันจะแผ่กางครีบเพราะเป็นปลาที่มีนิสัยชอบการต่อสู้ เป็นปลาสวยงามที่มูลค่าสูงและมีชื่อเสียงของประเทศไทย'),
(39, 'แป้น', 'Siamese-glassfish', 'เป็นปลาน้ำจืดขนาดเล็ก ลำตัวแบนข้างมาก หัวโต ตาโต รูปร่างค่อนข้างไปทางสี่เหลี่ยม มีครีบหลัง 2 อัน ครีบหลังอันแรกมีก้านครีบแข็งเป็นหนามแหลมอยู่ 7 ก้าน ครีบหลังอันที่สองมีเฉพาะก้านครีบฝอย ครีบก้นมีก้านครีบที่เป็นหนามแหลมอยู่ 3 ก้าน มีเกล็ดกลมบางใสและหลุดง่ายตัวใสหรือสีขาวคล้ายสีข้าวเม่า โปร่งใสจนมองเห็นอวัยวะภายใน อยู่รวมกันเป็นฝูงรักสงบไม่รบกวนปลาอื่น ขนาดเฉลี่ยความยาวประมาณ 3-6 ซม.', 'จุลินทรีย์และตัวอ่อนแมลงน้ำ', 'เป็นปลาขนาดเล็ก เลี้ยงเป็นฝูงในตู้ที่มีพรรณไม้น้ำ นิยมนำมาฉีดสีสะท้อนแสงเข้าบริเวณข้างลำตัวเพื่อให้มีสีสันสวยงามแล้วส่งขายต่างประเทศ'),
(40, 'เสือตอ', 'Siamese-tigerfish', 'รูปร่างแบนข้าง ปากยาวสามารถยืดได้ครีบก้นเล็กมีก้านครีบแข็ง 3 ชิ้นครีบหลังแบ่งเป็น 2 ตอน ตอนแรกเป็นก้านครีบแข็งมีเงี่ยง 13 ชิ้นตอนหลังเป็นครีบอ่อน พื้นลำตัวสีเหลืองน้ำตาลจนถึงสีส้มอมดำ มีแถบสีดำคาดขวางลำตัวในแนวเฉียงรวมทั้งสิ้นประมาณ 5 - 6 แถบ ส่วนหัวมีลักษณะลาดเอียงมาก เกล็ดเป็นแบบสาก (Ctenoid) มีลักษณะนิสัยอยู่เป็นฝูงเล็ก ๆ ใต้น้ำ โดยมักจะอาศัยบริเวณใกล้ตอไม้หรือโพรงหินด้วยการอยู่ลอยตัวอยู่นิ่ง ๆ หัวทิ่มลงเล็กน้อย หากินในเวลากลางคืนโดยกินอาหารแบบฉกงับ (Snap) ขนาดใหญ่สุดความยาวประมาณ 40 ซม.', 'สัตว์น้ำขนาดเล็กและแมลงต่าง ๆ', 'เลี้ยงในตู้ปลาขนาดใหญ่ ตกแต่งด้วยก้อนหินและขอนไม้'),
(41, 'หางไหม้', 'Silver-shark', 'ลำตัวสีเงิน ครีบสีเหลืองอ่อน ขอบนอกของครีบทุกครีบยกเว้นครีบอกมีขอบสีดำค่อนข้างหนา บริเวณโคนหางและโคนหลังมีสีดำจาง ๆ ปากเล็กไม่มีฟัน ปากยึดหดได้ริมฝีปากบนยื่นยาวกว่าริมฝีปากล่างขนาดใหญ่สุดความยาวประมาณ 25 ซม.', 'แพลงก์ตอนพืช แพลงก์ตอนสัตว์และตัวอ่อนแมลงน้ำ', 'เลี้ยงเป็นฝูงในตู้ปลาขนาดใหญ่ ร่วมกับปลาชนิดอื่น ๆ ตกแต่งตู้โดยใช้ก้อนหินหรือขอนไม้ ไม่นำพรรณไม้นำมาตกแต่ง เพราะเป็นปลาที่ชอบกินพืช เป็นปลาสวยงามที่ได้รับความนิยมสูง มีรูปร่างปราดเปรียวสวยงาม ว่ายน้ำรวดเร็วจึงมีชื่อเรียกอีกชื่อหนึ่งว่า “ฉลามหางไหม้” ปัจจุบันปลาที่มีจำหน่ายในประเทศไทยเป็นปลาที่นำพ่อแม่พันธุ์มาจากประเทศอินโดนีเซียแล้วนำมาเพาะพันธุ์โดยวิธีผสมเทียม'),
(42, 'น้ำหมึก', 'Stream-barilius', 'ลำตัวค่อนข้างเรียวยาว ด้านบนของลำตัวมีสีเขียวอมเหลือง บริเวณส่วนล่างจะมีสีจางลงตามข้างลำตัวมีแถบสีดำชัดเจนขวางอยู่เป็นระยะประมาณ 7-9 แถบ ครีบหลังมีลายสีดำแซมอยู่ประปรายเช่นเดียวกับปลานางอ้าว ขนาดเฉลี่ยความยาวประมาณ 8 ซม.', 'แพลงก์ตอนสัตว์ลูกปลา แมลงที่บินตกลงบนผิวน้ำ ลูกกุ้ง และตัวอ่อนแมลงน้ำ', 'เลี้ยงเป็นฝูงในตู้ปลาขนาดกลาง ว่ายน้ำรวดเร็ว มีสีสันสวยงาม เลี้ยงรวมกับปลาชนิดอื่นได้'),
(43, 'ตะเพียนลาย', 'Striped-barb', 'มีรูปร่างแบบปลาตะเพียนแต่ลำตัวเรียวแบบกระสวย ส่วนหัวและจะงอยปากค่อนข้างเรียว ปากเล็ก มีหนวด 2 คู่ ครีบหางเว้าลึก ลำตัวมีสีน้ำตาลแดงหรือเหลืองเข้ม ข้างแก้มและด้านท้องสีจาง เกล็ดมีสีเงินเหลือบ มีแถบสีดำตามแนวยาวของลำตัว 5-6 แถบ ตั้งแต่ด้านหลังจนถึงด้านท้อง แถบใหญ่สุดอยู่ที่กลางลำตัว ตามแนวเส้นข้างตัวไปถึงโคนครีบหาง ในปลาตัวเล็กมีบั้งตามแนวขวางลำตัว 4 บั้ง บนพื้นสีเหลืองอ่อนเมื่อเริ่มโตขึ้นจะเปลี่ยนเป็นแถบตามแนวยาว ขนาดใหญ่สุดพบความยาวประมาณ 10 ซม.', 'แพลงก์ตอนสัตว์และตัวอ่อนแมลงน้ำ', 'เลี้ยงเป็นฝูงในตู้ปลาขนาดเล็กที่มีพรรณไม้น้ำเป็นปลาป่าพรุที่เลี้ยงไม่ยากปรับตัวง่าย เลี้ยงรวมกับปลาอื่นได้หลายชนิด สามารถเลี้ยงจนมีไข่ในตู้ปลาขนาดเล็ก'),
(44, 'แขยงข้างลาย', 'Striped-dwarf-catfish', 'เป็นปลาไม่มีเกล็ดขนาดเล็ก พื้นลำตัวสีเทาเงินหรือสีน้ำตาลเทา ส่วนหัวและแผ่นหลังมีสีคล้ำกว่าข้างลำตัว ใต้ท้องสีขาว ข้างลำตัวมีแถบลายเส้นสีน้ำตาลเทา 2 แถบ คาดตามยาวจากหลังเหงือกจรดโคนหาง หลังช่องเหงือกมีจุดสีดำล้อมรอบด้วยวงแหวนสีขาว ส่วนหัวใหญ่ ครีบแต่ละครีบลักษณะโปร่งใสมีสีดำแซมประปราย ขนาดเฉลี่ยความยาวประมาณ 13 ซม.', 'ปลาขนาดเล็ก ลูกกุ้ง แมลงน้ำ ซากสัตว์และพืชที่เน่าเปื่อย', 'เลี้ยงในตู้ร่วมกับปลาไม่มีเกล็ดชนิดอื่นที่มีขนาดใกล้เคียงกัน จัดตู้โดยวางวัสดุตกแต่งประเภทก้อนหินหรือขอนไม้เพื่อให้มีที่หลบซ่อน'),
(45, 'ซิวหางกรรไกร', 'Three-lined-rasbora', 'ลำตัวยาวเรียวและแบนข้างเล็กน้อย ส่วนหัวและปากมีขนาดเล็ก ไม่มีหนวดลำตัวมีสีเขียวอ่อน ส่วนล่างของลำตัวมีสีซีดกว่าบริเวณด้านข้างและด้านหลังของลำตัว กลางลำตัวมีแถบสีดำพาดจากหัวถึงโคนหางและยาวเลยไปถึงส่วนของก้านครีบหางด้วย เหนือแถบสีดำมีแถบสีเงินเล็ก ๆ ข้างละ 1 แถบ พาดขนานไปกับแถบสีดำนี้ เหนือฐานครีบก้นมีแถบสีดำเล็ก ๆ ข้างละแถบ ตอนปลายของแถบทั้งสองนี้จะไปชนกันบริเวณปลายฐานครีบก้นแล้วยาวเลยไปถึงโคนครีบหาง ปลาชนิดนี้มีจุดเด่นอยู่ที่ครีบหางเนื่องจากมีแถบสีดำพาดขวางแพนหางทั้งบนและล่าง ซึ่งแถบสีดำนี้อยู่ค่อนไปทางส่วนปลายของแพนหาง ขอบในและขอบนอกของแถบสีดำนี้มีแถบสีขาวพาดขนานคู่กันไปอีกด้วย สีดำและสีขาวนี้จะตัดกับสีเหลืองอ่อนซึ่งเป็นสีพื้นของครีบหางสวยสะดุดตามาก ครีบหลังมีก้านครีบเป็นสีเหลืองอ่อน ส่วนครีบก้น ครีบท้องและครีบอกใสไม่มีสีขนาดใหญ่สุดความยาวประมาณ 13 ซม. ขนาดเฉลี่ยความยาวประมาณ 6 ซม.', 'แพลงก์ตอนสัตว์ ตัวอ่อนแมลงน้ำขนาดเล็ก', 'เลี้ยงเป็นฝูงในตู้ปลาขนาดเล็กที่มีพรรณไม้น้ำ ได้รับความนิยมในตลาดต่างประเทศ'),
(46, 'กระดี่หม้อ', 'Three-spot-gourami', 'ลำตัวเพรียวยาวและแบนข้างมาก พื้นลำตัวมีสีเทาอ่อน มีแถบสีน้ำตาลอมเทาพาดเฉียงตลอดลำตัว ด้านข้างลำตัวมีจุดสีส้มอมน้ำตาลหรือสีดำขนาดใหญ่ 2 จุด อยู่บริเวณกึ่งกลางลำตัว 1 จุด บริเวณโคนครีบหางอีก 1 จุด แต่เหตุที่มีชื่อเรียกเรียก Three spot gourami เนื่องจากนับรวมตาเข้าไปอีก 1 จุด บริเวณครีบหลังครีบก้นและครีบหางมีจุดสีเหลืองกระจายทั่วไป ในปลาตัวผู้สีจะเข้มจนเป็นสีส้ม ปากมีขนาดเล็กยื่นเฉียงขึ้นด้านบน ตาโตตั้งอยู่ในระดับเดียวกับปาก ขนาดเฉลี่ยความยาวประมาณ 10 ซม.', 'แพลงก์ตอนพืช พืชน้ำขนาดเล็ก ตัวอ่อนแมลงน้ำ', 'เลี้ยงในตู้ที่มีพรรณไม้น้ำ ปัจจุบันมีการคัดพันธุ์ให้ได้สายพันธุ์เผือกเรียก “กระดี่เผือก”'),
(47, 'ตองลาย', 'Tiger-knife-fish', 'เป็นปลาที่มีขนาดค่อนข้างใหญ่ ลำตัวด้านข้างแบนมาก ลำตัวมีสีขาวเงินครึ่งท้ายของลำตัวมีแถบสีดำหลายแถบทอดขวางไปถึงครีบก้นและครีบหาง บริเวณส่วนหน้าของลำตัวมีจุดสีดำขนาดปานกลางกระจายอยู่ทั่วไป เกล็ดขนาดเล็กละเอียด ครีบก้นยาวมากเชื่อมกับครีบหางเป็นครีบเดียวกัน ครีบหลังและครีบหูมีขนาดไล่เลี่ยกัน ครีบท้องขนาดเล็กมากขนาดเฉลี่ยความยาวประมาณ 60 ซม.', 'ปลาขนาดเล็ก ลูกกุ้ง และสัตว์น้ำขนาดเล็ก', 'เลี้ยงในตู้ปลาขนาดใหญ่ ตกแต่งด้วยขอนไม้ หรือพรรณไม้น้ำ หากเลี้ยงเป็นฝูงเล็กต้องมีขนาดไล่เลี่ยกัน'),
(48, 'หมูลายเสือ', 'Tiger-spiny-loach', 'รูปร่างป้อม ลำตัวแบนข้าง หัวเรียวแหลม ปากแหลม ลำตัวเป็นสีเทาปนเหลืองหรืออมเขียว มีแถบคาดตามลำตัวคล้ายลายเสือและมีจุดดำเรียงเป็นแถวตลอดลำตัว ครีบทุกครีบมีสีเหลืองอมส้มครีบหลังและครีบหางมีสีส้มและมีแถบดำและจุดดำกระจายทั่ว หากินตามพื้นท้องน้ำตามโขดหินและก้อนหิน ขนาดเฉลี่ยความยาวประมาณ 7 ซม.', 'แพลงก์ตอน ไรน้ำ ตัวอ่อนแมลงน้ำ', 'เลี้ยงในตู้ขนาดเล็กร่วมกับปลาชนิดอื่นได้ ตกแต่งตู้ด้วยก้อนหินหรือขอนไม้อุปนิสัยมักหลบตามที่หลบซ่อน วัสดุตกแต่งไม่ควรมีรูขนาดเล็กเมื่อปลาตกใจจะมุดเข้าไปติดแล้วออกไม่ได้'),
(49, 'เข็ม', 'Werstling-halfbeak', 'มีรูปร่างเรียวยาว ลำตัวเกือบกลมมีส่วนแบนตรงโคนหาง ลำตัวมีสีน้ำตาลอ่อน หางสีเหลือง ท้องสีขาวเหลืองฟ้า หัวเล็ก มีจะงอยปากแหลมยื่นยาวออกไป ครีบหลังและครีบก้นมีสีเหลืองอยู่ค่อนไปทางด้านหาง ครีบหางกลมมนมีขนาดใหญ่ ขนาดใหญ่สุดความยาวประมาณ 4 ซม. ปัจจุบันมีการคัดสายพันธุ์เป็นปลาเผือกซึ่งได้รับความนิยมมากเรียกว่า “เข็มเผือก”', 'แพลงก์ตอน ตัวอ่อนแมลง ชอบว่ายหากินอยู่บริเวณใกล้ผิวน้ำ', 'เลี้ยงในตู้ปลาที่ตกแต่งด้วยพรรณไม้น้ำ อุปนิสัยชอบว่ายลอยตัวบนผิวน้ำ'),
(50, 'หมูเหลือง', 'Yellow-tail-loach', 'ลำตัวแบนข้างเล็กน้อยและค่อนข้างป้อมกว่าปลาหมูชนิดอื่นๆสีลำตัวเป็นสีเทาหรือเทาอมเขียว บริเวณด้านหลังสีเข้มกว่าด้านข้างลำตัวท้องสีเหลืองอ่อนหรือขาว บริเวณโคนหางมีจุดสีดำ สำหรับปลาวัยอ่อนที่ยังไม่โตเต็มที่ จนมีแถบสีดำเล็ก ๆ พาดขวางลำตัว 4-5 แถบ และเมื่อปลามีอายุมากขึ้นแถบเหล่านี้จะหายไป จะงอยปากค่อนข้างยาวปลายจะงอยปากมีหนวด 2 คู่ และมุมปากมีหนวดอีก 1 คู่ ปากอยู่ปลายสุดและอยู่ในระดับต่ำ บริเวณหน้าตามีหนามแหลมปลายแยกเป็น 2 แฉกขนาดใหญ่และแข็งแรง ครีบทุกครีบไม่มีก้านครีบแข็ง ครีบหลังครีบก้นและครีบหางมีสีเหลืองจนถึงสีส้มหรือแดง โดยเฉพาะครีบหางจะมีสีสดกว่าครีบอื่น ๆ ครีบอกและครีบท้องสีเหลืองจาง ๆ เป็นปลาที่มีขนาดใหญ่ที่สุดในสกุลปลาหมูที่พบในประเทศไทย ขนาดใหญ่ที่สุดเท่าที่เคยสำรวจพบมีความยาวถึง 23.5 ซม. ขนาดเฉลี่ยความยาวประมาณ 12 ซม.', 'ตัวอ่อนแมลงน้ำ หนอนและซากสัตว์', 'เลี้ยงในตู้ขนาดเล็กร่วมกับปลาชนิดอื่นได้ ตกแต่งตู้ด้วยก้อนหินหรือขอนไม้อุปนิสัยมักหลบตามที่หลบซ่อน วัสดุตกแต่งไม่ควรมีรูขนาดเล็กเมื่อปลาตกใจจะมุดเข้าไปติดแล้วออกไม่ได้');

-- --------------------------------------------------------

--
-- Table structure for table `product`
--

CREATE TABLE `product` (
  `No` int(11) NOT NULL,
  `Seller_Email` varchar(50) NOT NULL,
  `Fish_name` varchar(100) NOT NULL,
  `Price` float NOT NULL,
  `Amount` int(11) NOT NULL,
  `Images` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `product`
--

INSERT INTO `product` (`No`, `Seller_Email`, `Fish_name`, `Price`, `Amount`, `Images`) VALUES
(1, 'fhufun2541@gmail.com', 'กระดี่มุก', 11, 22, 'static\\images\\product_images\\0896785d-c2e3-418b-8d8c-c9f54ee622a0.jpg'),
(2, 'fhufun2541@gmail.com', 'เสือพ่นน้ำ', 11, 12, 'static\\images\\product_images\\8a933506-c097-4f29-bda7-54bf4724e31d.jpg'),
(4, 'fhufun2541@gmail.com', 'แรด', 11, 15, 'static\\images\\product_images\\e34fbda0-8b67-4851-8170-87afbbf6f41d.jpg'),
(5, 'fhufun2541@gmail.com', 'กราย', 5, 2, 'static\\images\\product_images\\4d9ecbc4-6e22-4e1f-bd98-b5741c176569.jpg'),
(6, 'fhufun2541@gmail.com', 'สวาย', 2, 3, 'static\\images\\product_images\\797c5b12-4029-4ee8-8dad-78760bc1bd34.jpg'),
(7, 'fhufun2541@gmail.com', 'มังกร', 25, 1222222, 'static\\images\\product_images\\197c252d-17bf-405c-981e-705da55ac43f.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `seller`
--

CREATE TABLE `seller` (
  `Seller_Name` varchar(100) NOT NULL,
  `Seller_Last` varchar(100) NOT NULL,
  `Address` varchar(1000) NOT NULL,
  `Phone_Number` text NOT NULL,
  `Email` varchar(50) NOT NULL,
  `Password` text NOT NULL,
  `Store_Name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `seller`
--

INSERT INTO `seller` (`Seller_Name`, `Seller_Last`, `Address`, `Phone_Number`, `Email`, `Password`, `Store_Name`) VALUES
('1', '2', '3', '4', '5', '6', '7'),
('Thawatchai', 'Saetan', '230/12 soi 7 คลองเจ้าคุณสิงห์', '0840206599', 'fhufun2541@gmail.com', '$5$rounds=535000$7wGq9f.I4Ha46Eiq$T/9sA5apnNXuulE7j5Oo32hmxZSal7mjuXr2RAaWO63', 'BankFsi'),
('Funnu', 'sten', '230/12 soi 7 คลองเจ้าคุณสิงห์', '0840206599', 'funfhu2541@gmail.com', '$5$rounds=535000$4a6TccOTbmXEDoMm$8.5URtntBFeutFiSDkViac3iaFrEDgkWu7H6qIm8c/5', 'Sadara');

-- --------------------------------------------------------

--
-- Table structure for table `store`
--

CREATE TABLE `store` (
  `store_code` varchar(1000) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `store_name` varchar(1000) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `fishdb`
--
ALTER TABLE `fishdb`
  ADD PRIMARY KEY (`No`);

--
-- Indexes for table `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`No`);

--
-- Indexes for table `seller`
--
ALTER TABLE `seller`
  ADD PRIMARY KEY (`Email`);

--
-- Indexes for table `store`
--
ALTER TABLE `store`
  ADD PRIMARY KEY (`store_code`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `product`
--
ALTER TABLE `product`
  MODIFY `No` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
